/*
Напишите функцию `includesElement`, которая принимает массив и элемент, а затем возвращает булево значение, указывающее, содержится ли данный элемент в массиве. Для перебора элементов используйте цикл `for`.

Входные данные:
- `array`: Массив, в котором нужно проверить наличие элемента. Массив может содержать любые типы данных.
- `element`: Элемент, наличие которого нужно проверить в массиве.

Выходные данные:
- `true`: Если элемент найден в массиве.
- `false`: Если элемент отсутствует в массиве.

Пример использования:
includesElement([1, 2, 3], 2)  // должен вернуть `true`.
*/
const i = [12, 23, 33];
const a = i.includes(23)
function includesElement(i) {

for (let c = 0; c < i.includes; c++) {
    if (i[c] === 23) {
        a = false;
        break;
    } 
}
    if (a) {
        console.log(a);
        
    } else console.log(a);
    
        
    }

