/*
Напишите функцию `includesElement`, которая принимает массив и элемент, а затем возвращает булево значение, указывающее, содержится ли данный элемент в массиве. Для перебора элементов используйте цикл `for`.

Входные данные:
- `array`: Массив, в котором нужно проверить наличие элемента. Массив может содержать любые типы данных.
- `element`: Элемент, наличие которого нужно проверить в массиве.

Выходные данные:
- `true`: Если элемент найден в массиве.
- `false`: Если элемент отсутствует в массиве.

Пример использования:
includesElement([1, 2, 3], 2)  // должен вернуть `true`.
*/
//let index = 0; index < i.length; index++
//caunt++
function includesElement([a, b, c]) {
    const i = [a, b, c]
for (let caunt = 0; caunt < i.length; caunt++) {
    //const element = i[index];
    if (i = [b]) {
        return i.includes [b]
        
    } else {
        return i.includes [b]
        

    }
}
}
//i.includes(b)